____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to
====================================================================================================
flatten_1 (Flatten)              (None, 16)            0           flatten_input_1[0][0]
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 256)           4352        flatten_1[0][0]
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 256)           65792       dense_1[0][0]
____________________________________________________________________________________________________
dense_3 (Dense)                  (None, 4)             1028        dense_2[0][0]
====================================================================================================
Total params: 71172
____________________________________________________________________________________________________
