____________________________________________________________________________________________________
Layer (type)                     Output Shape          Param #     Connected to
====================================================================================================
convolution2d_1 (Convolution2D)  (None, 32, 3, 3)      160         convolution2d_input_1[0][0]
____________________________________________________________________________________________________
convolution2d_2 (Convolution2D)  (None, 64, 2, 2)      8256        convolution2d_1[0][0]
____________________________________________________________________________________________________
maxpooling2d_1 (MaxPooling2D)    (None, 64, 1, 1)      0           convolution2d_2[0][0]
____________________________________________________________________________________________________
flatten_1 (Flatten)              (None, 64)            0           maxpooling2d_1[0][0]
____________________________________________________________________________________________________
dense_1 (Dense)                  (None, 256)           16640       flatten_1[0][0]
____________________________________________________________________________________________________
dense_2 (Dense)                  (None, 4)             1028        dense_1[0][0]
====================================================================================================
Total params: 26084
____________________________________________________________________________________________________
